# HOMEWORK 1

## DATABASE CREATION

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (2.2.1)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2024.1)
Requirement already satisfied: numpy<2,>=1.22.4; python_version < "3.11" in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (1.26.4)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2024.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install numpy

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (1.26.4)
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install matplotlib

Requirement already satisfied: matplotlib in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (3.8.3)
Requirement already satisfied: cycler>=0.10 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (4.49.0)
Requirement already satisfied: numpy<2,>=1.21 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: pillow>=8 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (10.2.0)
Requirement already satisfied: python-dateutil>=2.7 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: pyparsing>=2.3.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (3.1.1)
Requirement already satisfied: contourpy>=1.0.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: packaging>=20.0 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (23.2)
Requirement already satisfied: importlib-resources>=3.2.0; python_version < "3.10" in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (6.1.2)
Requirement already satisfied: kiwisolver>=1.3.1 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Requirement already satisfied: zipp>=3.1.0; python_version < "3.10" in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from importlib-resources>=3.2.0; python_version < "3.10"->matplotlib) (3.17.0)
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from openpyxl) (1.1.0)
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [6]:
#Monthly_reurn include 278 months and 2051 firms (rows)
monthly_return_index_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/ESG_Scores/DS_RI_T_USD_M.xlsx'  # Replace with your Excel file name
df_monthly_ri = pd.read_excel(monthly_return_index_path)



#Monthly_capitalization include 278 months and 2051 firms 
monthly_capitalization_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/ESG_Scores/DS_MV_USD_M.xlsx'  # Replace with your Excel file name
df_monthly_capitalization = pd.read_excel(monthly_capitalization_path)



#M ountry to region data
region_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/CountriesToRegions.xlsx'  # Replace with your Excel file name
df_region = pd.read_excel(region_path)

In [7]:
df_region

            % AMER: Cnada + USA               Unnamed: 1 Unnamed: 2
0    % FRON: Frontier countries                      NaN        NaN
1    % SA: Standalone countries                      NaN        NaN
2        % EM: Emerging markets                      NaN        NaN
3                           NaN                      NaN        NaN
4                          Code                     Name     Region
..                          ...                      ...        ...
97                           US            UNITED STATES       AMER
98                           VI  VIRGIN ISLANDS, BRITISH      Other
99                           VN                VIET NAM        FRON
100                          ZA            SOUTH AFRICA          EM
101                          ZM                ZIMBABWE          SA

[102 rows x 3 columns]

In [8]:
#let's  keep only the EUR contries

df_region.drop(index=[0,1,2,3], inplace= True )

df_EUR = df_region[df_region['Unnamed: 2'] == 'EUR']

#Rename the column so we can merge later
df_EUR = df_EUR.rename(columns={'% AMER: Cnada + USA' : 'ISIN_First2'})

print(df_EUR)

   ISIN_First2       Unnamed: 1 Unnamed: 2
7           AT          AUSTRIA        EUR
11          BE          BELGIUM        EUR
19          CH      SWITZERLAND        EUR
26          DE          GERMANY        EUR
27          DK          DENMARK        EUR
30          ES            SPAIN        EUR
31          FI          FINLAND        EUR
32          FR          FRANCE         EUR
33          GB  UNITED KINGDOM         EUR
43          IE          IRELAND        EUR
44          IL          ISRAEL         EUR
48          IT            ITALY        EUR
71          NL      NETHERLANDS        EUR
72          NO          NORWAY         EUR
80          PT        PORTUGAL         EUR
87          SE          SWEDEN         EUR

In [9]:
#Now merged with the two dataset 
#First step we need to create a new columns with only the 2 first characters of the columns ISIN

#First with the return data 

df_monthly_ri['ISIN_First2'] = df_monthly_ri ['ISIN'].str[:2]
df_monthly_ri.head()

,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,2000-06-30 00:00:00,2000-07-31 00:00:00,2000-08-31 00:00:00,...,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00,ISIN_First2
0,AN8068571086,SCHLUMBERGER,1858.26,2254.15,2334.75,2336.65,2245.09,2283.70,2262.67,2610.77,...,3603.19,4261.29,3315.58,3433.33,3537.17,3344.15,4846.68,4801.97,4997.02,AN
1,ARALUA010258,ALUAR,1820.11,1911.12,1866.11,1835.93,1805.22,1657.42,1911.95,1982.99,...,4024.78,3845.16,3472.87,5651.92,5459.78,4847.48,4827.59,5377.66,5524.11,AR
2,ARP125991090,BBVA BANCO FRANCES,396.54,467.49,418.37,350.66,352.52,401.75,404.48,398.47,...,185.10,185.83,170.00,224.44,242.69,242.21,225.97,240.64,299.57,AR
3,ARSIDE010029,TERNIUM ARGENTINA SOCIEDAD ANONIMA,177.53,184.55,184.16,171.05,112.65,120.55,124.93,137.21,...,1141.96,1055.43,1025.82,1373.67,1428.06,1263.78,1286.25,1257.52,1463.58,AR
4,AT00000VIE62,FLUGHAFEN WIEN,156.25,153.83,158.62,137.27,148.95,159.68,151.08,153.35,...,1044.97,1035.49,1258.39,1229.26,1215.93,1190.06,1198.76,1248.90,1269.03,AT

In [10]:
#With the capitalization now
df_monthly_capitalization['ISIN_First2'] = df_monthly_capitalization ['ISIN'].str[:2]
df_monthly_capitalization.head()

,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,2000-06-30 00:00:00,2000-07-31 00:00:00,2000-08-31 00:00:00,...,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00,ISIN_First2
0,AN8068571086,SCHLUMBERGER,33574.85,40611.13,43352.43,43387.86,41861.39,42466.02,42074.79,48547.80,...,55139.08,64962.64,50578.51,52374.81,53958.90,50906.19,73778.56,73097.94,75806.25,AN
1,ARALUA010258,ALUAR,1328.64,1395.07,1362.23,1340.19,1317.78,1209.89,1395.69,1447.55,...,2195.00,2097.04,1894.01,3013.90,2911.44,2584.93,2574.33,2778.90,2853.52,AR
2,ARP125991090,BBVA BANCO FRANCES,1570.39,1851.34,1656.82,1388.70,1352.22,1541.05,1551.54,1528.48,...,1081.26,1085.52,993.08,1227.99,1318.36,1308.06,1206.71,1285.05,1591.32,AR
3,ARSIDE010029,TERNIUM ARGENTINA SOCIEDAD ANONIMA,1407.47,1463.08,1460.01,1356.04,893.05,955.70,990.45,1087.76,...,4778.90,4416.77,4292.86,5748.56,5673.71,5021.04,5110.32,4996.17,5814.86,AR
4,AT00000VIE62,FLUGHAFEN WIEN,567.85,559.05,576.48,498.86,517.64,554.94,525.07,532.96,...,2388.16,2366.48,2875.89,2809.31,2778.87,2719.75,2739.62,2854.20,2900.21,AT

In [11]:
#Second step we merge the data set with the region, keeping only the one matching the EUR countries
df_EUR_monthly_capitalization = pd.merge(df_EUR,  df_monthly_capitalization, on='ISIN_First2', how='inner')
df_EUR_monthly_ri = pd.merge(df_EUR,  df_monthly_ri, on='ISIN_First2', how='inner')

In [12]:
df_EUR_monthly_capitalization.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,567.85,559.05,576.48,498.86,517.64,...,2453.36,2388.16,2366.48,2875.89,2809.31,2778.87,2719.75,2739.62,2854.20,2900.21
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,1803.98,1857.91,1910.40,1827.24,1810.26,...,15823.98,13448.16,13356.15,10873.35,10824.56,9715.28,9532.79,10602.50,13099.32,13715.54
2,AT,AUSTRIA,EUR,AT0000743059,OMV,2583.84,2113.74,2065.10,2223.10,2305.32,...,15799.81,16951.82,19071.10,15313.75,13821.87,13255.37,11981.47,15085.69,16902.76,16800.81
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,1655.07,1781.21,1618.73,1446.45,1554.72,...,18088.45,18353.60,16894.99,16612.75,18659.53,16321.45,14584.20,13333.42,15082.96,14289.58
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,1386.43,1283.95,1428.44,1487.43,1567.26,...,3511.64,3280.93,3173.55,2466.15,2635.59,2703.34,2324.62,2634.32,2896.84,2690.25

In [13]:
df_EUR_monthly_ri.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,156.25,153.83,158.62,137.27,148.95,...,1073.50,1044.97,1035.49,1258.39,1229.26,1215.93,1190.06,1198.76,1248.90,1269.03
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,94.91,97.74,100.50,96.13,97.86,...,567.30,482.13,504.75,410.92,409.07,367.15,360.26,400.68,495.04,518.33
2,AT,AUSTRIA,EUR,AT0000743059,OMV,389.64,318.75,311.41,335.24,356.91,...,4277.87,4589.77,5163.58,4341.76,3918.78,3758.17,3396.99,4277.10,4792.28,4763.37
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,524.60,564.59,518.56,463.37,498.05,...,8285.25,8406.71,7820.72,7690.07,8637.53,7555.23,6751.05,6172.06,6981.93,6614.67
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,2379.46,2203.58,2451.55,2552.81,2746.80,...,6331.35,5915.37,5895.80,4581.59,4896.37,5022.24,4318.66,4894.01,5548.18,5152.51

In [14]:
df_EUR_monthly_capitalization.to_csv('/Users/camillevermenouze/Documents/SMTS2/SEF/df_EUR_monthly_capitalization.csv', index=False)
df_EUR_monthly_ri.to_csv('/Users/camillevermenouze/Documents/SMTS2/SEF/df_EUR_monthly_return.csv', index=False)
#We have now 508 firms with the data for 281 months

## IMPORT MONTHLY DATASET

In [15]:
import ssl

ssl._create_default_https_context = ssl._create_unverified_context

In [16]:
urlmri = "https://raw.githubusercontent.com/GiammarcoBozzelli/SEF/main/df_EUR_monthly_return.csv"
dfmri = pd.read_csv(urlmri)

urlmcapitalization = "https://raw.githubusercontent.com/GiammarcoBozzelli/SEF/main/df_EUR_monthly_capitalization.csv"
dfmcapitalization = pd.read_csv(urlmcapitalization)

In [17]:
dfmri.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,156.25,153.83,158.62,137.27,148.95,...,1073.50,1044.97,1035.49,1258.39,1229.26,1215.93,1190.06,1198.76,1248.90,1269.03
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,94.91,97.74,100.50,96.13,97.86,...,567.30,482.13,504.75,410.92,409.07,367.15,360.26,400.68,495.04,518.33
2,AT,AUSTRIA,EUR,AT0000743059,OMV,389.64,318.75,311.41,335.24,356.91,...,4277.87,4589.77,5163.58,4341.76,3918.78,3758.17,3396.99,4277.10,4792.28,4763.37
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,524.60,564.59,518.56,463.37,498.05,...,8285.25,8406.71,7820.72,7690.07,8637.53,7555.23,6751.05,6172.06,6981.93,6614.67
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,2379.46,2203.58,2451.55,2552.81,2746.80,...,6331.35,5915.37,5895.80,4581.59,4896.37,5022.24,4318.66,4894.01,5548.18,5152.51

In [18]:
dfmcapitalization.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,567.85,559.05,576.48,498.86,517.64,...,2453.36,2388.16,2366.48,2875.89,2809.31,2778.87,2719.75,2739.62,2854.20,2900.21
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,1803.98,1857.91,1910.40,1827.24,1810.26,...,15823.98,13448.16,13356.15,10873.35,10824.56,9715.28,9532.79,10602.50,13099.32,13715.54
2,AT,AUSTRIA,EUR,AT0000743059,OMV,2583.84,2113.74,2065.10,2223.10,2305.32,...,15799.81,16951.82,19071.10,15313.75,13821.87,13255.37,11981.47,15085.69,16902.76,16800.81
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,1655.07,1781.21,1618.73,1446.45,1554.72,...,18088.45,18353.60,16894.99,16612.75,18659.53,16321.45,14584.20,13333.42,15082.96,14289.58
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,1386.43,1283.95,1428.44,1487.43,1567.26,...,3511.64,3280.93,3173.55,2466.15,2635.59,2703.34,2324.62,2634.32,2896.84,2690.25

## IMPORT YEARLY DATASET

In [19]:
urlyri = 'https://raw.githubusercontent.com/GiammarcoBozzelli/SEF/main/df_EUR_yearly_return.csv'
dfyri = pd.read_csv(urlyri)

urlycapitalization = 'https://raw.githubusercontent.com/GiammarcoBozzelli/SEF/main/df_EUR_yearly_capitalization.csv'
dfycapitalization = pd.read_csv(urlycapitalization)

In [20]:
dfyri.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,x1999,x2000,x2001,x2002,x2003,...,x2013,x2014,x2015,x2016,x2017,x2018,x2019,x2020,x2021,x2022
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,147.79,169.02,126.01,166.81,248.09,...,684.58,771.62,806.23,853.19,1422.45,1416.63,1557.53,1369.41,1111.83,1269.03
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,102.94,108.87,131.07,169.47,316.50,...,451.57,303.59,409.64,391.16,594.97,471.37,557.68,451.74,724.56,518.33
2,AT,AUSTRIA,EUR,AT0000743059,OMV,393.88,323.77,363.83,444.88,698.11,...,3044.74,1763.66,1970.76,2554.70,4696.74,3335.71,4458.82,3450.98,5033.33,4763.37
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,669.42,490.55,365.21,421.52,588.39,...,1382.09,1279.70,907.90,1161.74,1787.80,3197.60,3808.49,6593.93,8769.64,6614.67
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,2579.95,2186.26,1776.97,2322.13,3626.22,...,2882.81,2537.95,3437.56,3262.29,4602.01,3984.99,5887.01,6511.05,7637.80,5152.51

In [21]:
dfycapitalization.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,x1999,x2000,x2001,x2002,x2003,...,x2013,x2014,x2015,x2016,x2017,x2018,x2019,x2020,x2021,x2022
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,537.09,794.55,560.96,705.15,985.36,...,1765.22,1952.09,1998.43,2073.22,3394.09,3312.76,3559.53,3129.62,2540.95,2900.21
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,1956.67,2269.47,2677.13,4006.48,7354.92,...,15002.04,10003.77,13498.31,12613.95,18633.43,14272.63,16191.42,13115.57,20210.51,13715.54
2,AT,AUSTRIA,EUR,AT0000743059,OMV,2611.95,2091.29,2262.75,2651.31,4021.35,...,15689.64,8716.35,9289.96,11584.60,20761.05,14309.77,18398.00,13214.41,18590.05,16800.81
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,2111.95,1531.28,1129.55,1285.83,1763.91,...,3639.54,3150.65,2193.28,2724.73,4117.86,7246.80,8549.44,14549.09,19145.95,14289.58
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,1503.25,1247.43,974.04,1161.06,1743.94,...,1866.50,1627.64,2198.92,2044.74,2846.44,2418.25,3450.66,3675.69,4236.26,2690.25

## TASK 1

Compute the annualized average RI and annualized volatility for all individual assets over the period 2008–2022. Plot and comment the histogram of these distributions. Compute and comment on the correlation between individual average RIs and volatilities in the cross section. (10 points)

In [21]:
#jrjzeo^z